app/controllers/applications_controller.rb

SELECT "applications".* FROM "applications"
---
  def index
    applications = Application.all

SELECT "applications".* FROM "applications" WHERE "applications"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
---
  def show
    application = Application.find_by(token: params[:token])

INSERT INTO "applications" ("token", "name", "chats_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["token", "[FILTERED]"], ["name", "whatsapp"], ["chats_count", 0], ["created_at", "2024-05-01 20:27:43.100188"], ["updated_at", "2024-05-01 20:27:43.100188"]]
---
  def create
    application = Application.new(application_params)
    if application.save

SELECT "applications".* FROM "applications" WHERE "applications"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "applications" SET "name" = ?, "updated_at" = ? WHERE "applications"."id" = ?  [["name", "facebook2"], ["updated_at", "2024-05-01 20:40:33.170415"], ["id", 6]]
---
  def update
    application = Application.find_by(token: params[:token])
    if application.update(application_params)