app/controllers/chats_controller.rb

SELECT "applications".* FROM "applications" WHERE "applications"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]
---
  def set_application
    @application = Application.find_by(token: params[:application_token])