app/controllers/chats_controller.rb

  def index
    chats = @application.chats
    chat_attributes = chats.map { |chat| { number: chat.number, messages_count: chat.messages_count } }
---
SELECT "chats".* FROM "chats" WHERE "chats"."application_id" = ?  [["application_id", 1]]

    def show
      chat = @application.chats.find(params[:number])
---
SELECT "chats".* FROM "chats" WHERE "chats"."application_id" = ? AND "chats"."id" = ? LIMIT ?  [["application_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    chat = @application.chats.build
    if chat.save
---
INSERT INTO "chats" ("number", "application_id", "messages_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["number", 1], ["application_id", 1], ["messages_count", 0], ["created_at", "2024-05-01 20:53:26.099007"], ["updated_at", "2024-05-01 20:53:26.099007"]]

  def set_application
    @application = Application.find_by(token: params[:application_token])
---
SELECT "applications".* FROM "applications" WHERE "applications"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]