app/controllers/messages_controller.rb

  def create
    message = @chat.messages.build(message_params)
    if message.save
---
INSERT INTO "messages" ("number", "body", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["number", 1], ["body", "Hi there!"], ["chat_id", 1], ["created_at", "2024-05-01 21:10:33.096511"], ["updated_at", "2024-05-01 21:10:33.096511"]]

  def update
    message = @chat.messages.find(params[:number])

    if message.update(message_params)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" IN (?, ?)  [["id", 1], ["id", 2]]
UPDATE "messages" SET "body" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["body", "Hi buddy!"], ["updated_at", "2024-05-01 21:25:28.027974"], ["id", 1]]

  def set_application
    @application = Application.find_by(token: params[:application_token])
---
SELECT "applications".* FROM "applications" WHERE "applications"."token" = ? LIMIT ?  [["token", "[FILTERED]"], ["LIMIT", 1]]

  def set_chat
    @chat = @application.chats.find_by(number: params[:chat_number])
---
SELECT "chats".* FROM "chats" WHERE "chats"."application_id" = ? AND "chats"."number" = ? LIMIT ?  [["application_id", 1], ["number", 1], ["LIMIT", 1]]