app/models/chat.rb

UPDATE "applications" SET "chats_count" = COALESCE("chats_count", 0) + ? WHERE "applications"."id" = ?  [["chats_count", 1], ["id", 1]]
---
  def increment_application_chat_count
    application.increment!(:chats_count)