app/models/message.rb

UPDATE "chats" SET "messages_count" = COALESCE("messages_count", 0) + ? WHERE "chats"."id" = ?  [["messages_count", 1], ["id", 1]]
---
  def increment_chat_messages_count
    chat.increment!(:messages_count)